#ifndef TASK_DISTRIBUTION_INSTANCE_TAG_HPP
#define TASK_DISTRIBUTION_INSTANCE_TAG_HPP

namespace td {
namespace types {
/** ------------------------------------------------------------------------------------
 * @brief The tg_instance enum - метки исполнителей
 * Данные метки отображают уровень доступности каждого исполнителя
 ---------------------------------------------------------------------------------------*/
enum class tg_instance {
    _tg_status_unknown_ = 0x00,         /// <--- статус исполнителя не известен
    _tg_status_unavailable_ = 0x01,     /// <--- исполнитель недоступен
    _tg_status_work_ = 0x02,            /// <--- исполнитель выполняет задачу
    _tg_status_free_ = 0x04             /// <--- исполнитель не имеет назначенных задач
};

/** --------------------------------------------------------------------------------------
 * @brief The tg_moving enum - метки движения исполнителей
 * Данные метки отображает способ движения исполнителей задач
 ----------------------------------------------------------------------------------------*/
enum class tg_moving {
    _tg_unknown_ = 0x00,                /// <--- тип неизвестен
    _tg_pedestrian_ = 0x01,             /// <--- пешеход
    _tg_bicycle_ = 0x02,                /// <--- велосипед
    _tg_motorbike_ = 0x04,              /// <--- мотоцикл
    _tg_car_ = 0x08,                    /// <--- автомобиль
    _tg_public_transport_ = 0x10        /// <--- общественный транспорт
};
}       /// <--- types
}   /// <--- td

#endif
