#ifndef TASK_DISTRIBUTION_TASK_TAG_HPP
#define TASK_DISTRIBUTION_TASK_TAG_HPP

namespace td {
namespace types {
/** ---------------------------------------------------------------------------------------------------------
 * @brief The tg_task enum - метки задач (с приоритетами)
 -----------------------------------------------------------------------------------------------------------*/
enum class tg_task {
    _tg_unknown_    = 0x00,         /// <--- тип задачи неизвестен
    _tg_emergency_  = 0x01,         /// <--- тип задачи "авария" (приоритет наивысший)
    _tg_connection_ = 0x02,         /// <--- тип задачи "подключение" (приоритет средний)
    _tg_local_task_ = 0x04,         /// <--- тип задачи "локальная заявка" (наименьший приоритет)
    _tg_additional_order_ = 0x10    /// <--- тип задачи "дозаказ"
};
}       /// <--- types
}   /// <--- td

#endif
